E1623ParkingSensor/nRF52_application/main.c
static void get_battery_low_warning(void);
static void send_battery_low_warning(void);


/**@brief Function for assert macro callback.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of 
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);
    
    

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/* Data handler dummy for initializing the Send Data Custom service in services_init() */
static void sdc_data_handler(ble_sdc_t * p_sdc, uint8_t * p_data, uint16_t length)
{
  
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_sdc_init_t sdc_init;
    
    memset(&sdc_init, 0, sizeof(sdc_init)); // Function for setting the given struct to zeros (or any other given value). 

    sdc_init.data_handler = sdc_data_handler; // Setting the handler part of the sdc_init struct to be the dummy handler implemented above.
    
    err_code = ble_sdc_init(&m_sdc, &sdc_init); // Initializing the Send Data Custom service with the given structs.
    APP_ERROR_CHECK(err_code);
}


/* Handler for Send Data Custom Service on BLE events. */
void ble_sdc_on_ble_evt(ble_sdc_t * p_sdc, ble_evt_t * p_ble_evt)
{
    if ((p_sdc == NULL) || (p_ble_evt == NULL))
    {
        return;
    }

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            on_connect(p_sdc, p_ble_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_disconnect(p_sdc, p_ble_evt);
            saadc_sampling_event_disable();
            break;

        case BLE_GATTS_EVT_WRITE:
            on_write(p_sdc, p_ble_evt);
            send_battery_low_warning();
            saadc_sampling_event_enable();
            break;

        default:
            // No implementation needed.
            break;
    }
}

/* Function for handling connection failed parametres. Results in disconnect. */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;
    
    if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}



// For use in (Pairing/Bonding).
static void sys_evt_dispatch(uint32_t sys_evt)
{
    fs_sys_event_handler(sys_evt);
    ble_advertising_on_sys_evt(sys_evt);
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;
    
    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;
    
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;
    
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_SLOW:  // Advertising event slow.
            break;
        case BLE_ADV_EVT_IDLE: // When advertising times out.
            err_code = ble_advertising_start(BLE_ADV_MODE_SLOW); // Restart advertising.
            APP_ERROR_CHECK(err_code);
            break;
        default:
            // Do nothing
            break;
    }
}


/**@brief Function for the application's SoftDevice event handler.
 *
 * @param[in] p_ble_evt SoftDevice event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{   
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            //get_battery_low_warning();
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            NRF_GPIO->OUT = (1<<6);               // Pin for enabling power to sensor.
            
            break;
            
        case BLE_GAP_EVT_DISCONNECTED:
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            NRF_GPIO->OUT = (0<<6);               // Pin for disabling power to sensor.
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for dispatching a SoftDevice event to all modules with a SoftDevice 
 *        event handler.
 *
 * @details This function is called from the SoftDevice event interrupt handler after a 
 *          SoftDevice event has been received.
 *
 * @param[in] p_ble_evt  SoftDevice event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    ble_conn_state_on_ble_evt(p_ble_evt);    // Forward BLE events to the Connection State module (Pairing/Bonding required).
    ble_conn_params_on_ble_evt(p_ble_evt);   // Connection parametres event.
    on_ble_evt(p_ble_evt);                   // On BLE event.
    ble_sdc_on_ble_evt(&m_sdc, p_ble_evt);   // Send Data Custom Service.
    ble_advertising_on_ble_evt(p_ble_evt);   // Advertising.
    pm_ble_evt_handler(p_ble_evt);           // Forward BLE events to the Peer Manager (Pairing/Bonding required).

