E1623ParkingSensor/nRF52_application/main.c
        int i;
        for (i = 0; i<SAMPLES_IN_BUFFER; i++) 
        {
            value = value + p_event->data.done.p_buffer[i];
        }
        value = value/SAMPLES_IN_BUFFER;
        
        if (value <= 254) {
                if ( value > m_old_value ){
                    m_old_value = value;
                    data_to_send[0] = value;
                    err_code = ble_sdc_data_send(&m_sdc, data_to_send, 1);
                    APP_ERROR_CHECK(err_code);
                }
                else if ( (value <= m_old_value) && (value >= 25) ) {
                    data_to_send[0] = m_old_value;
                    err_code = ble_sdc_data_send(&m_sdc, data_to_send, 1);
                    APP_ERROR_CHECK(err_code);
                }
                else if ( (value <= m_old_value) && (value < 25) ) {
                    m_old_value = 0;
                    data_to_send[0] = value;
                    err_code = ble_sdc_data_send(&m_sdc, data_to_send, 1);
                    APP_ERROR_CHECK(err_code);
                }
        }
    }
}
/* Configuring function for saadc. */
static void saadc_configure(void)
{   
    nrf_saadc_channel_config_t config = {
        .resistor_p = NRF_SAADC_RESISTOR_DISABLED,         
        .resistor_n = NRF_SAADC_RESISTOR_DISABLED,         
        .gain       = NRF_SAADC_GAIN1_6,                   
        .reference  = NRF_SAADC_REFERENCE_INTERNAL,        
        .acq_time   = NRF_SAADC_ACQTIME_40US,              
        .mode       = NRF_SAADC_MODE_SINGLE_ENDED,         
        .pin_p      = NRF_SAADC_INPUT_AIN0,                 // P0.02 Inngang SAADC
        .pin_n      = NRF_SAADC_INPUT_DISABLED
    };
    
    nrf_saadc_channel_config_t config_bat = {
        .resistor_p = NRF_SAADC_RESISTOR_DISABLED,         
        .resistor_n = NRF_SAADC_RESISTOR_DISABLED,         
        .gain       = NRF_SAADC_GAIN1_6,                   
        .reference  = NRF_SAADC_REFERENCE_INTERNAL,        
        .acq_time   = NRF_SAADC_ACQTIME_40US,              
        .mode       = NRF_SAADC_MODE_SINGLE_ENDED,         
        .pin_p      = NRF_SAADC_INPUT_AIN1,                 // P0.03 Inngang SAADC
        .pin_n      = NRF_SAADC_INPUT_DISABLED
    };
    
    nrf_drv_saadc_config_t config_init = {
        .resolution = NRF_SAADC_RESOLUTION_8BIT,
        .oversample = NRF_SAADC_OVERSAMPLE_DISABLED,
        .interrupt_priority = NRF_APP_PRIORITY_LOW 
    };
    
    ret_code_t err_code = nrf_drv_saadc_init(&config_init, saadc_event_handler);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_drv_saadc_channel_init(0,&config);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_adc_buf,SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
    
    /*err_code = nrf_drv_saadc_channel_init(1,&config_bat);
    APP_ERROR_CHECK(err_code);*/

}

/*static void get_battery_low_warning(void) {

    NRF_SAADC->RESULT.MAXCNT = 1;
    NRF_SAADC->RESULT.PTR = (uint32_t)&m_buffer_bat;
    
    NRF_SAADC->TASKS_START = 1;
    while (NRF_SAADC->EVENTS_STARTED == 0);
    NRF_SAADC->EVENTS_STARTED = 0;
    
    NRF_SAADC->TASKS_SAMPLE = 1;
    while (NRF_SAADC->EVENTS_END == 0);
    NRF_SAADC->EVENTS_END = 0;
    
}*/

static void send_battery_low_warning(void) {
    uint32_t err_code;
    if (m_buffer_bat < 255) {
        uint8_t data_to_send[1] = {'E'};
        err_code = ble_sdc_data_send(&m_sdc, data_to_send, 1);
        APP_ERROR_CHECK(err_code);
    }
}


int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
    
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false); 
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init(erase_bonds);
    saadc_configure();
    saadc_sampling_event_init();
    
    NRF_GPIO->DIR = (1<<6);
    NRF_GPIO->OUT = (0<<6);
    
    err_code = ble_advertising_start(BLE_ADV_MODE_SLOW);
    APP_ERROR_CHECK(err_code);
    
    for (;;)
    {
        power_manage();
        
    }
}



